Revit 2024 API
NurbSpline.SetControlPointsAndWeights Method
Set the control points, weights simultaneously.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetControlPointsAndWeights(
	IList<XYZ> ctrlPoints,
	DoubleArray weights
)
Visual Basic
Public Sub SetControlPointsAndWeights ( _
	ctrlPoints As IList(Of XYZ), _
	weights As DoubleArray _
)
Visual C++
public:
void SetControlPointsAndWeights(
	IList<XYZ^>^ ctrlPoints,
	DoubleArray^ weights
)
Parameters
ctrlPoints
Type: System.Collections.Generic.IList<XYZ>
weights
Type: Autodesk.Revit.DB.DoubleArray
See Also
NurbSpline Class
Autodesk.Revit.DB Namespace